<style>
    /* 自动换行 */
    p{
        table-layout: fixed;
        word-wrap: break-all;
        word-break: normal;
        overflow: hidden;
    }
</style>
<p>心缘网络游戏儿童个人信息保护政策及监护人须知</p>

<p>
更新日期：2022年6月22日

生效日期：2022年6月22日
</p>

<p>
心缘角网络游戏儿童个人信息保护政策及监护人须知》（“《儿童个人信息保护政策》”）适用于成都心缘网络科技有限公司和/或其关联公司（统称“心缘网络”或“我们”）提供的游戏产品和服务（产品和服务统称为“服务”）。当儿童（指未满14周岁的未成年人）在使用心缘网络的服务时，心缘网络仅会在法律允许、监护人明确同意以及为儿童提供服务所必要的情况下收集、使用、存储、处理儿童的相关信息。心缘网络深知儿童个人信息安全的重要性，将尽全力保护儿童的信息安全与合法权益。

有关我们如何处理和保护已满14周岁用户的个人信息，请另行查看心缘角网络游戏个人信息保护政策》（ https://ak.hypergryph.com/protocol/privacy）。

请儿童的父母或其他监护人（以下简称 “监护人”）和您的孩子共同阅读并理解本《儿童个人信息保护政策》，特别是其中加粗的条款内容，并在充分理解并同意后使用我们的服务。

监护人特别说明：

若们获悉您的孩子未满14周岁，我们将根据本《儿童个人信息保护政策》进一步保护您的孩子的个人信息。请要求您的孩子在您的陪同下共同阅读本《儿童个人信息保护政策》，且应在您的同意和指导下提交个人信息、使用我们的服务。如果您不同意本《儿童个人信息保护政策》的任意内容，您应要求您的孩子立即停止使用我们的服务。若您点击同意本《儿童个人信息保护政策》，或者您的孩子使用/继续使用我们的服务，即表示您和您的孩子同意受本《儿童个人信息保护政策》的约束。
请您注意，心缘网络在提供服务的过程中可能会涉及第三方服务，包括但不限于指向第三方服务的广告、信息或其他链接，使用心缘账号登录第三方服务，登录心缘网络服务的过程中使用第三方账号。您理解并同意，前述第三方服务并非由心缘网络提供，也不受心缘网络控制，您的孩子在使用前述第三方服务时，需遵守第三方对应的个人信息保护政策或规则。
如您对我们的个人信息保护实践有相关疑问或权利请求时，请通过本《儿童个人信息保护政策》中披露的联系方式与我们联系。我们会在合理的时间内处理并回复您。

儿童特别说明：

如您为未满14周岁的儿童，请通知您的监护人在其陪同下共同阅读本《儿童个人信息保护政策》，并在您提交个人信息、使用我们的服务之前，寻求并取得您的监护人的同意和指导。若您点击同意本《儿童个人信息保护政策》，或者您使用/继续使用我们的服务、提交个人信息，表示您已获得您的监护人的许可，且您和您的监护人亦同意受本《儿童个人信息保护政策》的约束。

您将通过本《儿童个人信息保护政策》了解以下内容：

1、我们如何收集儿童的个人信息
2、我们如何使用儿童的个人信息
3、我们如何使用Cookie和同类技术
4、我们如何共享、转让、公开披露或委托处理儿童的个人信息
5、我们如何存储和保护儿童的个人信息
6、儿童和监护人的权利
7、如何联系我们
8、本《儿童个人信息保护政策》如何更新
一、我们如何收集儿童的个人信息
个人信息是指以电子或者其他方式记录的与已识别或者可识别的自然人有关的各种信息，不包括匿名化处理后的信息。心缘网络基于本《儿童个人信息保护政策》所述的以下目的，收集和使用儿童的以下个人信息。如需超过以下目的使用儿童的信息，心缘网络将另行征得监护人的同意或取得其他合法性依据：

1.1 儿童在使用我们服务时主动提供的信息
1.1.1 帮助儿童完成注册及登录
为帮助儿童注册、登录、使用心缘网络提供的服务，儿童主要会向我们提供的相关个人信息包括儿童的电话号码、电子邮箱、网络账号、密码、口令、昵称、头像等信息。
1.1.2 进行实名制认证
为满足相关法律法规政策及相关主管部门的要求，心缘网络用户需进行实名认证以继续使用和享受心缘网络。我们会在获得监护人同意或监护人主动提供的情况下收集儿童的实名身份信息，包括儿童的真实姓名、身份证号、生日、籍贯、性别、照片等，其中包含儿童的敏感个人信息，若儿童选择不提供实名身份信息，可能会导致儿童无法登录心缘网络的服务或在使用心缘网络的服务过程中受到相应限制。为实现实名认证的目的， 监护人同意并授权我们向有关实名认证机构（国家网络游戏主管部门、公安部门或者其委托/合作的其他机构）提供、查询、核对儿童的前述身份信息。
1.1.3 开展用户调研和活动
儿童通过我们的客服或参加我们举办的活动时所提交的信息。例如，儿童参与我们线上活动时填写的调查问卷中可能包含儿童的性别、教育程度、年龄等信息；儿童参与我们的包含赠品、奖品、生日祝福等增值服务，经监护人同意向我们提供的相关个人信息，包括姓名、电话、生日等。
1.2 我们在儿童使用我们服务时获取的信息
1.2.1 提供游戏基本功能
1.2.1.1 为了提供游戏服务的基本功能，我们会收集儿童的设备或软件信息，包括儿童的移动设备、网页浏览器或用于接入我们服务的其他程序所提供的配置信息、IP地址和终端设备（包括手机、平板电脑、电脑、 移动智能设备、家用游戏机、客户设备、无线路由器、操作系统及其他必备软、硬件或上网装置）所用的型号、设备识别码或设备 ID（MAC/IMEI/Android ID/IDFA/OpenUDID/GUID/SIM 卡IMSI 信息）、设备名称、设备类型和版本、设备分辨率、包名、设备设置、软硬件特征信息、系统版本、应用 ID、网络类型信息等。
1.2.1.2 我们会收集儿童的游戏日志信息，包括登录日志、物品日志、游戏对局信息、交友记录等，以便儿童能够在客户端查看游戏历史记录，同时用于游戏运营统计分析、客服投诉处理及其他游戏安全分析，并为提升儿童的游戏体验，我们可能把前述信息同步至该游戏后续版本或儿童正在使用的我们提供的其他服务中。
1.2.1.3 通过具有定位功能的移动设备，在儿童使用我们的服务时，我们可能通过GPS、基站、IP地址或WiFi等方式收集的儿童的地理位置信息；位置信息属于敏感个人信息，拒绝提供该信息只会导致儿童无法实现心缘网络服务对应的部分功能，但不影响儿童正常使用心缘网络服务的其他功能，儿童或监护人也可以随时取消儿童的地理位置信息授权。
1.2.2 帮助儿童完成下单、支付、充值并交付商品或服务
1.2.2.1 当儿童使用心缘网络服务的消费功能时，我们会收集儿童的充值记录、消费记录、订单号/流水号、订单创建时间、交易金额等信息，以便查询儿童的交易记录，同时尽最大程度保护儿童的虚拟物品安全。充值记录、消费记录属于敏感个人信息，我们收集该信息为实现心缘网络服务的消费功能所必须，否则将无法完成交易。
1.2.2.2 为完成订单支付或交付商品、服务、确认交易状态及为儿童或监护人提供售后与争议解决服务， 我们会通过儿童基于交易所选择的交易对象、支付机构、物流公司等，收集与交易进度相关的儿童的帐号、订单、交易、物流信息，或将儿童的交易信息共享给上述服务提供者。
1.2.3 维护网络及运营安全
1.2.3.1 为保障儿童的游戏账号安全，营造公平、健康及安全的游戏环境，我们会收集儿童的游戏识别信息、硬件及操作系统信息、进程及游戏崩溃记录等信息，以用于打击破坏游戏公平环境或干扰、破坏游戏服务正常进行的行为（如用于检测盗版、扫描外挂、防止作弊的目的）。
1.2.3.2 当儿童使用心缘网络服务的社交功能时，可以通过文字、图片、语音、视频及其他方式与其他玩家进行互动，我们可能会收集并保存儿童发送的上述信息内容用于过滤色情、暴力、政治、辱骂、恶意广告等不当内容，以此净化游戏环境，维护健康的上网环境。
1.2.4 个性化推荐
基于我们获得的儿童的个人信息（如儿童的设备信息、订单信息等），我们可能会基于上述一项或几项信息的结合，向儿童提供更契合个人需求的页面展示和推荐个性化内容及广告。如儿童或监护人不希望接受个性化推荐服务，可以在游戏服务的界面内查看管理方式并关闭相应功能。如对个性化推荐有任何问题，儿童或监护人可以通过本《儿童个人信息保护政策》下方提供的联系方式与我们进行联络。
1.2.4 申请系统权限
作为儿童的监护人，您理解并同意，在儿童使用服务的过程中，我们将在必要时申请访问儿童的系统权限，以实现这些权限所涉及信息的收集和使用。我们在开启权限前，将告知用户开启权限的目的并征求用户的同意，如用户不同意，我们将不会开启相关权限，也无法为儿童提供该权限所对应的服务。关于这些权限收集的信息和使用目的，请参见心缘角网络游戏应用权限申请与使用情况说明》。
权限类型	权限名称	权限功能说明	使用场景或目的
手机状态	android.permission.READ_PHONE_STATE	读取手机设备信息，包含手机号IMEI等信息	识别您的本机识别码，完成安全风控、进行统计
手机设置	android.permission.WRITE_SETTINGS	读写系统设置权限	允许应用读写系统设置项
网络	android.permission.INTERNET（访问网络权限）
android.permission.ACCESS_NETWORK_STATE（检查网络状态）
android.permission.ACCESS_WIFI_STATE（检查wifi状态）
访问网络权限，检查网络状态、wifi状态	监控网络变化，提示用户当前网络环境，实现应用程序联网
通知	android.permission.FOREGROUND_SERVICE	用于注册系统通知栏服务	推送游戏相关通知
存储	android.permission.WRITE_EXTERNAL_STORAGE
android.permission.READ_EXTERNAL_STORAGE	读取/写入手机外部存储	允许读取或者写入图片、文件等内容，用于提供信息发布或在本地记录崩溃日志信息等功能
1.3 我们从第三方处间接获取的信息
我们可能从第三方获取儿童授权共享的账户信息（ID、账户头像、昵称），使儿童可以通过第三方账户进行登录。我们还可能从第三方社交平台获取儿童参与我们在第三方社交平台举办的互动、抽奖活动时授权该第三方共享的收货信息，以便我们寄送奖品。
如果我们从第三方处获取了儿童的个人信息，我们会按照与第三方的约定，在符合相关法律和法规规定的前提下，使用儿童的这些个人信息。
二、我们如何使用儿童的个人信息
2.1 我们会将前述收集的信息用于以下用途。若我们需要出于其他目的收集和/或使用儿童的个人信息的，我们会另行征求监护人的同意（如适用法律要求）：
2.1.1 帮助儿童注册心缘网络账户：为便于我们向儿童提供服务，需要收集真实、完整、准确、有效的个人身份信息及其他相关信息以完成实名账户的注册。
2.1.2 向儿童提供游戏服务并维护网络及运营安全：为了向儿童提供服务，或为了使儿童获得更优质的服务体验，我们将收集并使用儿童的必要个人信息。
2.1.3 产品开发和服务优化：在产品开发和服务优化的过程中，儿童的信息可能会被用于分析故障原因、分析用户需求、进行个性化定制、进行产品升级等。儿童在单项服务中的信息可能会被用于心缘网络提供的其他服务之中，以用于完善相关服务。
2.1.4 向儿童推送信息以及个性化推荐：
2.1.4.1 商品或服务信息：心缘网络会根据已收集的关于儿童的信息，如浏览及搜索记录、设备信息、位置信息，提取其浏览偏好、行为习惯、位置信息等特征，通过电子邮件、短信、通知等方式向儿童推送相关心缘网络服务或第三方服务的广告或资讯；如儿童或监护人不希望继续接收我们推送的消息，可要求我们停止推送，例如：根据短信退订指引要求我们停止发送推广短信，或在移动设备中进行设置，不再接收我们推送的消息；但我们依法律规定或服务条款约定发送消息的情形除外。
2.1.4.2 系统公告：在必要时（如心缘网络提供的服务需要进行维护、变更、中止或终止等），我们将利用所提供的信息向儿童或监护人发出系统公告
2.1.5 为儿童提供安全保障：为了保障儿童的账户安全，我们可能会将儿童的信息用于实名认证、身份验证、安全防范、交易风险防范、反诈骗监控、存档备份、客户服务等用途。在此过程中，我们可能会在必要的限度内向第三方提供儿童的信息，用以实现前述目的，并要求第三方遵守本《儿童个人信息保护政策》的规定。
2.1.6 其他用途：如果我们要将儿童的个人信息用于本《儿童个人信息保护政策》中未载明的其他用途，我们会通过页面提示、交互流程、网站公告或其他方式另行征得监护人的同意（如适用法律要求）。如果监护人同意或继续使用我们的服务，该等额外用途将视为本《儿童个人信息保护政策》的一部分。
2.2 根据相关法律法规规定，以下情形中收集和/或使用儿童的信息可能无需征得监护人的授权同意，但我们仍将根据适用法律法规的要求，竭力维护儿童个人信息安全并保障监护人的知情权和决定权：
2.2.1 为订立、履行个人作为一方当事人的合同所必需；
2.2.2 为履行法定职责或者法定义务所必需；
2.2.3 为应对突发公共卫生事件，或者紧急情况下为保护自然人的生命健康和财产安全所必需；
2.2.4 为公共利益实施新闻报道、舆论监督等行为，在合理的范围内处理个人信息；
2.2.5 依照适用法律规定在合理的范围内处理个人自行公开或者其他已经合法公开的个人信息；
2.2.6 法律、行政法规规定的其他情形。
三、我们如何使用Cookie和同类技术
3.1 为向儿童提供个性化的用户体验和服务，我们或我们的第三方合作伙伴可能会通过Cookie、脚本、Web信标、Flash Cookie、内嵌Web链接、本地存储器等工具自动进行信息收集，这些第三方Cookie或同类技术收集和使用该等信息不受本《儿童个人信息保护政策》约束，而是受到其自身的信息保护声明约束，我们不对第三方的Cookie或同类技术承担责任。
3.2 儿童和监护人可以通过浏览器或用户选择机制拒绝或管理Cookie及同类技术，但若儿童和监护人拒绝前述技术，则可能无法享受最佳的服务体验或无法享受特定服务的部分功能。
四、我们如何共享、转让、公开披露或委托处理儿童的个人信息
4.1 共享
心缘网络非常重视保护儿童的个人信息。 我们仅会出于合法、正当、必要、特定、明确的目的向第三方提供儿童的个人信息。对于接收我们提供个人信息的公司、组织和个人，我们会与其签署严格的保密协议，要求他们按照双方的约定、本《儿童个人信息保护政策》以及其他相关的保密和安全措施来处理信息。我们可能在以下情况下与我们以外的任何第三方共享儿童的个人信息：
4.1.1 在获取监护人的单独同意的情况下共享：在向监护人告知接收方的名称或者姓名、联系方式、处理目的、处理方式和个人信息的种类并获得监护人的单独同意后，我们会与其他方共享儿童的个人信息。
4.1.2 我们可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享儿童的个人信息。
4.1.3 与我们的关联公司共享：儿童的个人信息可能会与我们的关联公司共享。我们只会共享必要的个人信息，且受本《儿童个人信息保护政策》中所声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求监护人的授权同意。
4.1.4 与第三方SDK类服务商共享：仅为实现本《儿童个人信息保护政策》中声明的目的，我们的某些服务将由第三方SDK类服务商提供。我们可能会与第三方SDK类服务商共享儿童的某些个人信息，以提供更好的客户服务和用户体验。我们仅会出于合法、正当、必要、特定、明确的目的共享儿童的个人信息，并且只会共享提供服务所必要的个人信息。前述服务商收集和处理信息等行为遵守其自身的隐私条款，而不适用于本《儿童个人信息保护政策》。儿童或监护人可以通过下表心缘角网络游戏第三方SDK清单》了解我们接入第三方SDK的具体情况：
名称	第三方SDK运营方	服务内场景描述	收集的个人信息	SDK个人信息保护政策/用户协议
微信支付	财付通支付科技有限公司	用于支付	设备版本、系统版本、生成ID、手机样式、手机名、iccid、bssid、MAC地址、IMSI、IMEI	https://www.tenpay.com/v3/helpcenter/low/privacy.shtml
支付宝支付	支付宝(中国）网络技术有限公司	用于支付	设备版本、系统版本、生成ID、手机样式、手机名、iccid、bssid、MAC地址、IMSI、IMEI	https://render.alipay.com/p/c/k2cx0tg8
热云TrackingIO	北京热云科技有限公司	用于广告投放及数据监测	联网信息、MAC地址、唯一设备识别码（IMEI、IDFA、安卓ID、设备硬件序列号）、广告标识	https://new.trackingio.com/#/policy
腾讯bugly	深圳市腾讯计算机系统有限公司	用于收集崩溃信息	联网信息、日志信息、设备ID、设备型号、系统名称、系统版本、国家码	https://static.bugly.qq.com/bugly-sdk-privacy-statement.pdf
极验GEETEST	武汉极意网络科技有限公司	用于人机验证	联网信息、设备型号、操作系统版本、MAC地址、唯一设备识别码（IMEI、IDFA、 Android ID、WMS）	https://www.geetest.com/Private
MTP（ACE）	深圳市腾讯计算机系统有限公司	用于检测外挂、反作弊	设备型号、系统版本、IMEI、IMSI、Android ID、MAC地址、网络类型、WIFI 名称、附近可连接WIFI名称、品牌、CPU架构、是否Root、ROM 的唯一标识、设备屏幕分辨率、系统启动时间、是否运行在模拟器、语言地区、剩余内存、剩余内置和外置 SD 卡空间容量、安装的 APK信息、运行的进程信息、host 文件、SD卡应用缓存目录下文件名列表	https://www.anticheatexpert.com/#/doc-center/8fc4c1195346a2c74e472881bca42c4010698921
百度oCPX转化追踪应用SDK （仅官方服百度推广渠道包使用）	百度在线网络技术（北京）有限公司	用于广告投放	联网信息、MAC地址、唯一设备识别码（IMEI、IDFA、Android ID、设备硬件序列号）、广告标识	https://ocpx-devcenter.bj.bcebos.com/videoworks/console-upload/%E3%80%90%E7%99%BE%E5%BA%A6oCPX%E5%BA%94%E7%94%A8SDK%E8%BD%AC%E5%8C%96%E8%BF%BD%E8%B8%AA%E5%B7%A5%E5%85%B7%E3%80%91%E9%9A%90%E7%A7%81%E6%94%BF%E7%AD%96.pdf?authorization=bce-auth-v1/e2ea496b5e7f4e20bd0e5d1ce5533588/2022-03-02T07%3A26%3A49Z/-1/host/a457d9fc218b82a94f1a1209ed821931c1f7703ffe40bd220ba25ce5e42f8056
rangersApplog（仅官方服今日头条推广渠道包使用）	北京巨量引擎网络技术有限公司	用于广告投放	联网信息、MAC地址、唯一设备识别码（IMEI、IDFA、Android ID、设备硬件序列号）、广告标识	https://open.oceanengine.com/labels/7/docs/1708428054592516
Bilibili SDK（仅哔哩哔哩渠道包使用）	成都宽娱数码科技有限公司	哔哩哔哩渠道提供账号登录、支付以及实名制服务时使用	个人常用设备信息（包括硬件序列号、硬件型号、设备MAC地址、操作系统类型、软件列表、唯一设备识别码）	https://www.bilibili.com/blackboard/privacy-pc.html
4.2 转让
我们不会将儿童的个人信息转让给任何公司、组织和个人，但以下情况除外：
4.2.1 在获取单独同意的情况下转让：获得监护人的单独同意后，我们会向其他方转让儿童的个人信息；
4.2.2 在涉及合并、收购或破产清算时，如涉及个人信息转让，我们会向监护人告知接收方的名称或者姓名和联系方式，并要求新的持有个人信息的公司、组织继续受本《儿童个人信息保护政策》的约束；如接收方变更原先的处理目的、处理方式，求该公司、组织应当重新向监护人征求授权同意。
4.3 公开披露
我们仅会在以下情况下，且采取符合业界标准的安全防护措施的前提下，披露儿童的个人信息：
4.3.1 获得监护人的单独同意或基于监护人的主动选择；
4.3.2 根据法律、法规的要求、强制性的行政执法或司法要求；
4.4 委托处理
我们会委托我们的关联公司和为我们公司提供产品和/或服务的第三方服务商以及合作伙伴（包括但不限于信息系统服务商、营销服务提供商、数据库平台提供商及运维商、活动执行公司、媒体运营公司、广告提供商、云服务提供商）代表我们处理儿童的个人信息。对我们委托处理个人信息的第三方，我们会与其签署严格的保密协定，要求其按照我们的要求、本《儿童个人信息保护政策》以及法律法规要求的保密和安全措施来处理个人信息。
4.5 分享、转让、披露个人信息时事先征得授权同意的例外
当发生如下情形时，我们可以不取得监护人的同意分享、转让、公开披露儿童的个人信息：
4.5.1 与我们履行法律法规规定的义务相关的；
4.5.2 与国家安全、国防安全直接相关的；
4.5.3 与公共安全、公共卫生、重大公共利益直接相关的；
4.5.4 与犯罪侦查、起诉、审判和判决执行等直接相关的
4.5.5 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
4.4.6 个人信息主体自行向社会公众公开的个人信息；
4.4.7 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。
4.4.8 法律法规规定的其他情形。
五、我们如何存储和保护儿童的个人信息
5.1 信息存储：
5.1.1 存储地点：我们将根据相关法律法规的要求存储儿童的个人信息，在法律适用的情况下，对于我们在中华人民共和国境内收集的信息，我们将存储在中国境内。
5.1.2 存储期限：我们将按相关法律法规的要求，依据本《儿童个人信息保护政策》第二条目的得以实现的必要期限，来存储儿童的信息。
5.2 信息保护：
5.2.1 我们将采取符合法律要求及业界标准的、合理可行的安全防护措施保护儿童的个人信息， 防止数据遭到未经授权的访问、披露、使用、修改、损坏或丢失。依据实际情况，我们可能采取的安全防护措施包括使用加密技术（例如SSL、TLS）处理个人信息、对个人信息进行匿名化处理或脱敏处理、为相关网站提供 https 安全浏览方式、建立数据分类分级、安全管理、内部访问权限等制度、开展内部安全和隐私保护培训等。
5.2.2 若发生个人信息安全事件，我们将按照法律法规的要求，启动相应的应急预案，并及时向儿童和监护人告知安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、儿童和监护人可自主防范和降低风险的建议、采取的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知儿童和监护人，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，及时上报个人信息安全事件的处置情况。
六、儿童和监护人的权利
按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障儿童和监护人对儿童的个人信息行使以下权利：

6.1 访问和复制儿童的个人信息
儿童和监护人有权在使用我们服务的过程中访问和复制儿童的个人信息，我们在单项服务中为儿童和监护人提供了相应的操作设置，儿童和监护人可据此进行操作。
6.2 公开儿童的个人信息
儿童和监护人可以通过我们的服务主动公开并与第三人共享儿童的个人信息。请注意，只要不删除已公开发布的信息，相关信息将一直留存在公开领域；即便已删除公开信息，相关信息也可能被第三人缓存、收集、复制或向公众提供。请儿童和监护人谨慎考虑主动披露儿童的个人信息，以及由此可能导致的信息泄露风险，特别是敏感个人信息（如种族、宗教、个人健康和医疗信息、身份证明文件、个人生物识别信息、财产信息、行踪轨迹），儿童和监护人可以使用我们的相关设置（如有）来控制公开信息的范围。如儿童和监护人通过上述渠道公开儿童的个人信息，由此导致的信息泄漏，或对儿童、监护人或他人的损害，我们不承担任何责任。
6.3 要求更正或删除儿童的个人信息
若儿童和监护人发现我们处理的关于儿童的个人信息存在错误的，可以要求我们进行更正。
若儿童和监护人发现我们处理个人信息的行为违反法律法规、与儿童和监护人的约定、本《儿童个人信息保护政策》，或儿童不再使用我们的服务的或已注销了账号，儿童和监护人可以要求我们删除儿童的个人信息。
作为监护人，您理解依据相关法律法规的强制性规定，我们可能无法响应要求删除信息的特定要求。
作为监护人，您理解儿童的部分或全部个人信息被删除后，与此相关的我们的服务，或其对应部分可能无法使用。
6.4 改变监护人授权同意的范围 监护人可以通过我们公布的渠道和方式改变监护人授权我们收集、使用、存储的个人信息的范围。当监护人撤回授权后，我们将无法继续为儿童提供撤回授权所对应的服务，也不再处理儿童的相应信息。但监护人收回授权同意的决定，不会影响此前基于监护人的授权而开展的个人信息处理。
6.5 限制自动化决策 在某些服务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制作出决定。如果这些决定显著影响儿童和监护人的合法权益，儿童和监护人有权要求我们作出解释，我们也将提供适当的救济方式。
6.6 注销账户 儿童和监护人可以根据我们的操作指引注销账户。在账户被注销之后，我们将停止为儿童提供服务，并依据要求删除儿童的个人信息，法律法规另有规定的除外。
6.7 响应儿童和监护人的上述请求
6.7.1 为保障安全，儿童和监护人可能需要提供书面请求，或以其他方式证明儿童和监护人的身份。我们可能会先要求验证身份，然后再处理儿童和监护人的请求。我们将在合理时限内做出答复。
6.7.2 对于儿童和监护人合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情况收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。
6.7 响应请求的例外情形
在以下情形中，按照法律法规要求，我们将无法响应儿童或监护人的请求：
6.8.1 与我们履行法律法规规定的义务相关的；
6.8.2 与国家安全、国防安全直接相关的；
6.8.3 与公共安全、公共卫生、重大公共利益直接相关的；
6.8.4 与犯罪侦查、起诉、审判和判决执行等直接相关的；
6.8.5 有充分证据表明儿童或监护人存在主观恶意或滥用权利的；
6.8.6 响应请求将导致儿童、监护人或其他个人、组织的合法权益受到严重损害的；
6.8.7涉及商业秘密的；
6.8.8 其他我们有合理理由拒绝的情形。
七、如何联系我们
如果对本《儿童个人信息保护政策》、儿童的个人信息收集、使用、存储等存在疑问，或有任何问题、建议或意见，儿童和监护人可以通过如下方式与我们联系：
电子邮箱：cs@hypergryph.com
邮寄地址：成都市徐汇区宜山路700号C2栋103室
我们将尽快审核所涉问题，并在验证身份后的15个工作日内予以回复。如不满意我们的回复，监护人还可以向消费者权益保护部门投诉或向有管辖权的法院提起诉讼。

八、本《儿童个人信息保护政策》如何更新
8.1 我们可能会对本《儿童个人信息保护政策》进行不定期的更新，并通过公告等方式进行公示。若存在对儿童和监护人权利产生实质性减损的变更，我们将通过在页面显著位置提示、向儿童和监护人发送电子邮件等合理方式进行告知
8.2 若您作为监护人允许您的孩子继续使用我们的服务，则视为您同意接受更新后的《儿童个人信息保护政策》。
</p>