<?php

return [
    'adminEmail' => 'admin@example.com',
    'senderEmail' => 'noreply@example.com',
    'senderName' => 'Example.com mailer',
    'adminEmail' => 'admin@example.com',
    'baseUrl' => '',
    'htmlUrl' => '/html',
    'upImage' => 'files/upload/image',
    'synchronous' => 'files/upload/record/',
    'upSpoken' => 'files/upload/spoken/',
    // 'SMS_SN' => 'DXX-WSS-102-08033',
    // 'SMS_SIG' => '雷哥网',
    // 'SMS_PWD' => '800616',
    'defaultImg' => '/cn/images/details_defaultImg.png',
    // 'appHost' => 'http://test.toeflonline.cn',
    'timeLimit' => 600,
    'alipay_path' => dirname(__FILE__).'/../libs/yii2_alipay/',
    'defaultImg' => '/cn/images/details_defaultImg.png',

    'point' => [  //图标
        'grade' => [ // 10个境界
            '后天' => '/files/image/rc.png', 
            '先天' => '/files/image/q.png',  
            '金丹' => '/files/image/sc.png',
            '元婴' => '/files/image/cr.png',
            '化神' => '/files/image/dc.png',
            '渡劫' => '/files/image/bk.png',
            '地仙' => '/cn/point/aritic.png',
            '天仙' => '/cn/point/fill.png',
            '金仙' => '/cn/point/math.png',
            '混元' => '/cn/point/read.png',
            '圣人' => '/cn/point/word.png',
        ],
        'race' => [  // 6个种族
            '人族' => '/files/image/rc.png', //万物之灵，属性+5%
            '妖族' => '/files/image/sc.png',  //混沌之源，触发+8%
            '神族' => '/files/image/sc.png', //天地之始，生命+20%
            '魔族' => '/files/image/cr.png', //万恶之源，爆发+15%     
            '魂族' => '/files/image/dc.png', //万物之源，法力+20%
            '灵族' => '/files/image/dc.png', //天地孕育，灵气+20%
        ],
        'word' => [  // 世界
            '时空秘境' => '/files/image/rc.png', //万物之灵，属性+5%        
            '古武世界' => '/files/image/rc.png', //万物之灵，属性+5%
            '小千世界' => '/files/image/sc.png',  //混沌之源，触发+8%
            '中千世界' => '/files/image/sc.png', //天地之始，生命+20%
            '大千世界' => '/files/image/cr.png', //万恶之源，爆发+15%     
            '混沌宇宙' => '/files/image/dc.png', //万物之源，法力+20%
        ],
    
        'template' => [  // 大首页配置
            1=>'<span style="color:red">客户风险异常，且近期查询异常,需协助人出面签约办理放款</span>',
            2=>'<span style="color:red">客户贷款用途存疑，还款能力不足，,需协助人出面签约办理放款</span>',
            3=>'<span style="color:red">客户大数据评分低，,需协助人出面签约办理放款</span>',
            4=>'<span style="color:red">系统匹配为信贷中等风险客户，,需协助人出面签约办理放款</span>',
            5=>'<span style="color:blue">恭喜您申请通过，等待面签放款</span>',
        ]
        // 后台单独建表 动态数据，存redis
        // 'monster' => [  // 生物
        //     '盘古' => '/files/image/rc.png', //万物之灵，属性+5%
        //     '女娲' => '',  //混沌之源，触发+8%
        //     '神族' => '/files/image/sc.png', //天地之始，生命+20%
        //     '魔族' => '/files/image/cr.png', //万恶之源，爆发+15%     
        //     '魂族' => '/files/image/dc.png', //万物之源，法力+20%
        //     '灵族' => '/files/image/dc.png', //天地孕育，灵气+20%
        // ],
        // 'skill' => [  // 技能
        //     '降龙' => '/files/image/rc.png', //万物之灵，属性+5%
        //     '女娲' => '/files/image/sc.png',  //混沌之源，触发+8%
        //     '神族' => '/files/image/sc.png', //天地之始，生命+20%
        //     '魔族' => '/files/image/cr.png', //万恶之源，爆发+15%     
        //     '魂族' => '/files/image/dc.png', //万物之源，法力+20%
        //     '灵族' => '/files/image/dc.png', //天地孕育，灵气+20%
        // ],
        // 'status' => [  // 技能效果
        //     '降龙' => '/files/image/rc.png', //万物之灵，属性+5%
        //     '女娲' => '/files/image/sc.png',  //混沌之源，触发+8%
        //     '神族' => '/files/image/sc.png', //天地之始，生命+20%
        //     '魔族' => '/files/image/cr.png', //万恶之源，爆发+15%     
        //     '魂族' => '/files/image/dc.png', //万物之源，法力+20%
        //     '灵族' => '/files/image/dc.png', //天地孕育，灵气+20%
        // ],

    ],

    'attribute' => [ 
        // 基础属性
        '力量' => '',  //
        '敏捷' => '',  //
        '智力' => '',  //
        '灵气' => '',  // 灵气伤害为真实伤害，特殊技能可以抵挡

        '生命' => '', //      
        '魔法' => '', //
        '攻击' => '',  //
        '护甲' => '',  // 抵挡物理伤害
        '法抗' => '',  // 抵挡技能伤害
        '速度' => '',  //
        
        '暴击率' => '', //
        '暴击伤害' => '', //
        '触发概率' => '', //

        // 成长属性
        '等级' => '',  //
        '境界' => '',  //
        '种族' => '',  //   
        '评分' => '',  //   
        '异形' => '',  // 成长提升20%
        '悟性' => '',  // 成长属性*1倍
        '幸运' => '',  //叠加战斗最终评分 物品最高10 

        '灵根' => '0',  // 无
        '元神' => '',  // 灵气伤害为真实伤害，特殊技能可以抵挡
        '技能' => '', //
        '缘分' => '', //   
        '装备' => '', //      

    ], 

    'attribute' => [  // 灵根
        '空灵根' => '',  //无
        '伪灵根' => '',  //速度-20%，生命+20%
        '真灵根' => '',  //护甲+12%法抗+12%
        '地灵根' => '',  //暴击率+10%
        '天灵根' => '',  //暴击伤害+50%
        '风灵根' => '',  //速度+20%
        
        '金灵根' => '',    //护甲+10%  
        '木灵根' => '',    //触发+8%   
        '水灵根' => '',    //法力+10%  
        '火灵根' => '',    //攻击+10%
        '土灵根' => '',    //生命+10%
        '丹灵根' => '',    //基础属性+5%
        // 异灵根
        '九灵剑体' => '',   //灵气+20%
        '器灵根' => '',   //武器加成+50%
        '不灭之体' => '',   //死亡复活一次
        '土灵之体' => '',   //力量+10%
        '锻金之体' => '',   //力量+10%
        '自治之体' => '',   //力量+10%
        '天阴之体' => '',   //法抗+20%
        '三阳之体' => '',   //护甲+20%
    ], 


    // 'introduce' => [  // 法宝介绍
    //     ['造化青莲']=>'即为混沌青莲，乃夺天地之造化，是为异数，即开天之时，遭天道之遣，化作先天法宝无数，二十四瓣莲花化成二十四片造化玉牒，上面记载着大道三千，后为鸿钧所得，并籍此悟道。混沌青莲的五片叶子化成了十大先天灵宝为五色五方旗（中央戊己杏黄旗、西方青莲宝色旗、南方离地焰光旗、东方素色云界旗、北方玄元控水旗）、乾坤鼎、十二品莲台、山河社稷图、河图洛书、天书（封神榜）、地书、冥书（生死薄）、红绣球，莲茎化为弑神枪。',
    //     ['业火红莲']=>'为血海冥河老祖所有。端坐莲台，防御惊人，燃烧业力化业火，攻防兼备。',
    //     ['灭世黑莲']=>'本为魔祖罗睺所有，后罗睺陨落，黑莲不知所踪。端坐莲台，防御惊人，能吸收暴虐气息。',
    //     ['净世白莲']=>'端坐莲台，无物可破，可净化天地万物，后化为三清得成道法宝，三宝玉如意,青萍剑,太乙拂尘。',
    //     ['功德金莲']=>'——为混沌十二魔神之一的接引道人的混沌之躯所化，防御无双！化作接引道人的证道之宝——十二品金莲，西方教镇教气运之物',
        
    //     ['造化玉牒']=>'二十四片造化玉牒，上面记载着大道三千，后为鸿钧所得，并籍此悟道。',
        
    //     ['紫竹']=>'被遁去的“一”附体的紫竹。',
        
    //     ['鸿钧道果']=>'鸿钧合道以后，天降功德化为七道成圣机缘，前六道赐予三清 、西方二圣和女娲，第七道被红云道人所得，红云道人被鲲鹏所杀死后不知所踪。',

    //     ['混沌灵果']=>'生长于归墟的混沌灵果（据说就是世界树)。',
        
    //     ['人参果']=>'——万寿山五庄观有人参果，此果又名草还丹，三千年一开花，三千年一结果，再三千年才得熟，短头一万年方得吃。',
            
    //     ['菩提树']=>'——乃是混沌十二魔神之一的准提道人的混沌之躯所化，沾染了先天的第一道金之精，是为先天五行灵根之一的金性灵根！被准提道人化为成道之宝——七宝妙树。',
            
    //     ['壬水蟠桃']=>'——鸿钧道祖所有，后赐予瑶池金母镇压天庭气运！是为先天五行灵根之一的水性灵根。',
            
    //     ['扶桑木']=>'——传说日出于扶桑之下，拂其树杪而升，因谓为日出处。多生林木，叶如桑。又有椹，树长者二千丈，大二千馀围。树两两同根偶生，更相依倚，是以名为扶桑也。乃妖族十太子所起之地。为妖族天帝帝俊所有，给其十大金乌栖身，放在汤谷！为火属性灵根。',
            
    //     ['黄中李']=>'——木属性灵根，不知道其踪迹。',
            
    //     ['苦竹']=>'——被接引道人取走炼做六根清净竹，可封人六感，乃先天灵宝。',
            
    //     ['绿柳']=>'——相传乃是混沌十二魔神之中最为神秘的扬眉道君的身体上的一根枝桠所化，被元始天尊得到后赐予阐教十二金仙的慈航道人，被化作了羊脂玉净瓶之中的杨柳枝，可聚三光神水,滋润万物。',
            
    //     ['仙杏']=>'——生于终南山玉柱洞。毕生结二果，为雷震子所食，化作风雷二翅。。',
        
    //     ['葫芦']=>'——生于不周山，结先天七葫芦，赤橙黄绿青蓝紫，各一个，为女娲，三清，陆压，红云，鸿钧所得，赤色为九九散魂葫芦（红云），橙色为招妖葫（女娲），黄色为斩仙飞刀（陆压），绿色（原始），青色（通天），蓝色[（鸿钧）延续香火]，紫色为紫金葫芦（老子）；葫芦藤为女娲所得用于造人，化作功德至宝。',

    //     ['道戍土之精']=>'——道戍土之精，是为先天五行灵根之一的土性灵根。',

    //     ['七宝妙树']=>'——先天五行灵根之一的金性灵根！被准提道人化为成道之宝。',

    //     ['月桂树']=>'乃太阴星中一棵灵根，与太阴灵脉相连，是以除非可以一击弄断，否则便会立刻复原。嫦娥奔月之后住于太阴星广寒宫中，而那传说中的大巫后羿追上来后，因为见不到那嫦娥，导致那神魂受损，是以化身吴刚伐桂。',
        
    // ],

    //姓名
    'xingming' => ['赵','钱','孙','李','周','吴','郑','王','冯','陈','褚','卫','蒋','沈','韩','杨','朱','秦','尤','许','何','吕','施','张','孔','曹','严','华','金','魏','陶','姜','戚','谢','邹',
    '喻','柏','水','窦','章','云','苏','潘','葛','奚','范','彭','郎','鲁','韦','昌','马','苗','凤','花','方','任','袁','柳','鲍','史','唐','费','薛','雷','贺','倪','汤','滕','殷','罗',
    '毕','郝','安','常','傅','卞','齐','元','顾','孟','平','黄','穆','萧','尹','姚','邵','湛','汪','祁','毛','狄','米','伏','成','戴','谈','宋','茅','庞','熊','纪','舒','屈','项','祝',
    '董','梁','杜','阮','蓝','闵','季','贾','路','娄','江','童','颜','郭','梅','盛','林','钟','徐','邱','骆','高','夏','蔡','田','樊','胡','凌','霍','虞','万','支','柯','管','卢','莫',
    '柯','房','裘','缪','解','应','宗','丁','宣','邓','单','杭','洪','包','诸','左','石','崔','吉','龚','程','嵇','邢','裴','陆','荣','翁','荀','于','惠','甄','曲','封','储','仲','伊',
    '宁','仇','甘','武','符','刘','景','詹','龙','叶','幸','司','黎','溥','印','怀','蒲','邰','从','索','赖','卓','屠','池','乔','胥','闻','莘','党','翟','谭','贡','劳','逄','姬','申',
    '扶','堵','冉','宰','雍','桑','寿','通','燕','浦','尚','农','温','别','庄','晏','柴','瞿','阎','连','习','容','向','古','易','廖','庾','终','步','都','耿','满','弘','匡','国','文',
    '寇','广','禄','阙','东','欧','利','师','巩','聂','关','荆','司马','上官','欧阳','夏侯','诸葛','闻人','东方','赫连','皇甫','尉迟','公羊','澹台','公冶','宗政','濮阳','淳于','单于','太叔',
    '申屠','公孙','仲孙','轩辕','令狐','徐离','宇文','长孙','慕容','司徒','司空','伟','刚','勇','毅','俊','峰','强','军','平','保','东','文','辉','力','明','永','健','世','广','志','义','兴','良','海','山','仁','波','宁','贵','福','生','龙','元','全'
    ,'国','胜','学','祥','才','发','武','新','利','清','飞','彬','富','顺','信','子','杰','涛','昌','成','康','星','光','天','达','安','岩','中','茂','进','林','有','坚','和','彪','博','诚'
    ,'先','敬','震','振','壮','会','思','群','豪','心','邦','承','乐','绍','功','松','善','厚','庆','磊','民','友','裕','河','哲','江','超','浩','亮','政','谦','亨','奇','固','之','轮','翰'
    ,'朗','伯','宏','言','若','鸣','朋','斌','梁','栋','维','启','克','伦','翔','旭','鹏','泽','晨','辰','士','以','建','家','致','树','炎','德','行','时','泰','盛','雄','琛','钧','冠','策'
    ,'腾','楠','榕','风','航','弘','秀','娟','英','华','慧','巧','美','娜','静','淑','惠','珠','翠','雅','芝','玉','萍','红','娥','玲','芬','芳','燕','彩','春','菊','兰','凤','洁','梅','琳'
    ,'素','云','莲','真','环','雪','荣','爱','妹','霞','香','月','莺','媛','艳','瑞','凡','佳','嘉','琼','勤','珍','贞','莉','桂','娣','叶','璧','璐','娅','琦','晶','妍','茜','秋','珊','莎'
    ,'锦','黛','青','倩','婷','姣','婉','娴','瑾','颖','露','瑶','怡','婵','雁','蓓','纨','仪','荷','丹','蓉','眉','君','琴','蕊','薇','菁','梦','岚','苑','婕','馨','瑗','琰','韵','融','园'
    ,'艺','咏','卿','聪','澜','纯','毓','悦','昭','冰','爽','琬','茗','羽','希','欣','飘','育','滢','馥','筠','柔','竹','霭','凝','晓','欢','霄','枫','芸','菲','寒','伊','亚','宜','可','姬'
    ,'舒','影','荔','枝','丽','阳','妮','宝','贝','初','程','梵','罡','恒','鸿','桦','骅','剑','娇','纪','宽','苛','灵','玛','媚','琪','晴','容','睿','烁','堂','唯','威','韦','雯','苇','萱'
    ,'阅','彦','宇','雨','洋','忠','宗','曼','紫','逸','贤','蝶','菡','绿','蓝','儿','翠','烟','东华','上清','青','莲','天','展'],

    



    'loading' => [  // 大首页配置
        0 => [ // 10个境界
            'url' => 'http://www.monster.com/app/loading/loading.jpg', 
            'type' => 'jpg',  
            'name' => '背景图',
        ],
        1 => [ // 10个境界
            'url' => '/http://www.monster.com/app/loading/剑指苍茫.mp3', 
            'type' => 'mp3',  
            'name' => '背景音乐',
        ],
    ],
    
    'tips' => [  // 大首页配置
        'shenhun'=>'
        可吞噬天材地宝1次，绑定对应属性，与装备叠加，吞噬后不可更改。天书、千年人参、蟠桃、杏黄李，妖丹。装备栏 ，注：可吞噬，装备亦可，吞噬装备与神魂绑定，转生后仍然存在。
        默认可吞噬1次，异性2次，特殊物品噬神丹，可叠加次数，累计最多4次。多宝道人神通技能可叠加1次，不与神魂叠加，技能替换后自动消失。
        ',
        'xiulian'=>'
            修炼体系：分为体修，法修，均可通过战斗提升，概率较低。
            体修以自身成长属性为主。最高100级*最高成长属性80=8000,
            法修以境界为主。最高境界为混元圣人属性=6000+100级*最低属性20左右=8000,
            体修挑战等级上限，提升等级需要精魄，每个人物图鉴可获得精魄。
            法修挑战境界上限，提升境界需天材地宝突破境界，境界越高概率越低，高级天材地宝可增加突破概率。
            注：法修耗费资源过多，建议新手以体修为主。境界可以用夺舍进行境界转移，50%几率夺舍失败神魂俱灭，请小心使用。
        ',
        'shuxing'=>'抽卡只能抽取地仙境界',
        'shuxing'=>'
            1力量=100血量，1点全攻，1点全防御，2点生命恢复，
            1敏捷=50血量，3点物攻，2点防御，1点生命恢复，
            1智力=50法力，3点法攻，2点法抗，2点法力恢复，
            1幸运=闪避+1，触发率+1，宝物获取率+1，
            1灵气=2全属性，
            1悟性(根骨)=成长根骨，每级+1自由属性点，
            境界=全属性叠加
            注：闪避上限值为80%。
        ',
        // 'shenhun'=>'默认可吞噬1次，异性2次，特殊物品噬神丹，可叠加次数，累计最多4次。多宝道人神通技能可叠加1次，不与神魂叠加，技能替换后自动消失。
        // 可吞噬天材地宝1次，绑定对应属性，与装备叠加，吞噬后不可更改。天书、千年人参、蟠桃、杏黄李，妖丹。装备栏 ，注：可吞噬，装备亦可，吞噬装备与神魂绑定，转生后仍然存在。',
        // 'shenhun'=>'默认可吞噬1次，异性2次，特殊物品噬神丹，可叠加次数，累计最多4次。多宝道人神通技能可叠加1次，不与神魂叠加，技能替换后自动消失。
        // 可吞噬天材地宝1次，绑定对应属性，与装备叠加，吞噬后不可更改。天书、千年人参、蟠桃、杏黄李，妖丹。装备栏 ，注：可吞噬，装备亦可，吞噬装备与神魂绑定，转生后仍然存在。',
        // 'shenhun'=>'默认可吞噬1次，异性2次，特殊物品噬神丹，可叠加次数，累计最多4次。多宝道人神通技能可叠加1次，不与神魂叠加，技能替换后自动消失。
        // 可吞噬天材地宝1次，绑定对应属性，与装备叠加，吞噬后不可更改。天书、千年人参、蟠桃、杏黄李，妖丹。装备栏 ，注：可吞噬，装备亦可，吞噬装备与神魂绑定，转生后仍然存在。',
    ]


];
